soap-samples/error-test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:shape="http://wuniversity.edu/se/shapetool">
   <soapenv:Header/>
   <soapenv:Body>
      <shape:CircleAreaRequest>
         <shape:radius>-10.0</shape:radius>
      </shape:CircleAreaRequest>
   </soapenv:Body>
</soapenv:Envelope>